src/cf/InformationRegisters/ДоступноеВремяФизическихЛиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ДоступноеВремяФизическихЛиц</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДеньНедели</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВремяНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВремяОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/ДоступноеВремяФизическихЛиц/Ext/RecordSetModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ПараметрыСеанса.ЗагрузкаОбработанныхДанныхИзДругойСистемы Тогда
		Возврат;
	КонецЕсли;
	
	// Для записи набора записей требуем чтобы был установлен отбор по физ. лицу
	ФизическоеЛицо = Отбор.Найти("ФизическоеЛицо").Значение;
	Если Не ЗначениеЗаполнено(ФизическоеЛицо) Тогда
		ВызватьИсключение НСтр("ru = 'Запрещено записывать набор регистра сведений ""Доступное время физических лиц"" без установки отбора по физическому лицу.'");
	КонецЕсли;
	
	// Для каждого времени доступности требуем чтобы время начала было не больше времени окончания
	Для Каждого Запись Из ЭтотОбъект Цикл
		
		Если Запись.ВремяОкончания < Запись.ВремяНачала Тогда
			ПромежутокВремениСтрокой = РаботаСРабочимКалендаремКлиентСервер.ПолучитьПромежутокВремениСтрокой(
				Запись.ВремяНачала, Запись.ВремяОкончания, Запись.ДеньНедели);
			ТекстИсключения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Время окончания не может быть меньше времени окончания доступности:
					|%1'"),
				ПромежутокВремениСтрокой);
			ВызватьИсключение ТекстИсключения;
		КонецЕсли;
		
	КонецЦикла;
	
	// Если есть дубликаты записей или же пересекающие записи то корректируем набор записей
	Если НеобходимоСкорректироватьНаборЗаписей() Тогда
		СкорректироватьНаборЗаписей();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

Функция НеобходимоСкорректироватьНаборЗаписей()
	
	// Проверяем дублирование записей
	Для Каждого ПроверяемаяЗапись Из ЭтотОбъект Цикл
		НайденаЗапись = Ложь;
		Для Каждого Запись Из ЭтотОбъект Цикл
			Если ЗаписиСовпадают(ПроверяемаяЗапись, Запись) Тогда
				Если НайденаЗапись Тогда
					Возврат Истина;
				Иначе
					НайденаЗапись = Истина
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	// Проверяем пересечение записей
	Для Каждого ПроверяемаяЗапись Из ЭтотОбъект Цикл
		Для Каждого Запись Из ЭтотОбъект Цикл
			Если ПроверяемаяЗапись.ДеньНедели = Запись.ДеньНедели
				И ПроверяемаяЗапись.ВремяНачала <= Запись.ВремяОкончания
				И ПроверяемаяЗапись.ВремяОкончания >= Запись.ВремяНачала Тогда
				Возврат Истина;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

Функция ЗаписиСовпадают(Запись1, Запись2)
	
	Возврат Запись1.ДеньНедели = Запись2.ДеньНедели
		И Запись1.ВремяНачала = Запись2.ВремяНачала
		И Запись1.ВремяОкончания = Запись2.ВремяОкончания
		И Запись1.ФизическоеЛицо = Запись2.ФизическоеЛицо;
	
КонецФункции

Процедура СкорректироватьНаборЗаписей()
	
	ТребуетсяВнестиКоррективы = Истина;
	
	Пока ТребуетсяВнестиКоррективы Цикл
		
		ТребуетсяВнестиКоррективы = Ложь;
		
		МассивЗаписей = Выгрузить();
		
		Очистить();
		
		Для Каждого Запись Из МассивЗаписей Цикл
			
			ВнестиЗаписьВНаборЗначений = Истина;
			
			Для Каждого ВнесеннаяЗапись Из ЭтотОбъект Цикл
				
				Если ЗаписиСовпадают(Запись, ВнесеннаяЗапись) Тогда
					ВнестиЗаписьВНаборЗначений = Ложь;
					Прервать;
				КонецЕсли;
				
				Если Запись.ФизическоеЛицо = ВнесеннаяЗапись.ФизическоеЛицо
					И Запись.ДеньНедели = ВнесеннаяЗапись.ДеньНедели
					И Запись.ВремяНачала <= ВнесеннаяЗапись.ВремяОкончания
					И Запись.ВремяОкончания >= ВнесеннаяЗапись.ВремяНачала Тогда
					
					ВнесеннаяЗапись.ВремяНачала = Мин(ВнесеннаяЗапись.ВремяНачала, Запись.ВремяНачала);
					ВнесеннаяЗапись.ВремяОкончания = Макс(ВнесеннаяЗапись.ВремяОкончания, Запись.ВремяОкончания);
					
					ТребуетсяВнестиКоррективы = Истина;
					ВнестиЗаписьВНаборЗначений = Ложь;
					Прервать;
					
				КонецЕсли;
				
			КонецЦикла;
			
			Если НЕ ВнестиЗаписьВНаборЗначений Тогда
				Продолжить;
			КонецЕсли;
			
			НоваяСтрока = Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Запись);
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
